# Создаем матрицу для примера
'''
1.	В матрице найти номер строки, сумма чисел в которой максимальна. '''
matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

# Инициализируем переменные для хранения максимальной суммы и ее индекса
#max_sum = float('-inf')
#float('-inf') обозначает отрицательную бесконечность,
# то есть наименьшее возможное число в пределах типа float.
# Это значение используется, например, для инициализации переменной,
# которая будет хранить максимальное значение,
# чтобы убедиться, что первое сравниваемое значение будет больше этого "пустого" значения.
#max_sum_index = -1


# Используем первую строку матрицы для инициализации переменных
max_sum = sum(matrix[0])
max_sum_index = 0
# Итерируемся по строкам матрицы и суммируем числа в каждой строке
for i in range(len(matrix)):
    row_sum = sum(matrix[i])
    # Если сумма в текущей строке больше максимальной, то обновляем значения переменных
    if row_sum > max_sum:
        max_sum = row_sum
        max_sum_index = i

# Выводим номер строки с максимальной суммой чисел
print(f'Номер строки с максимальной суммой чисел: {max_sum_index}')
