def cut_rectangle(a, b):
    if a == b:  # Если стороны уже равны, возвращаем длину ребра квадрата и количество квадратов (1)
        return a, 1
    elif b < a:  # Если сторона a больше стороны b, режем прямоугольник по стороне a
        side, count = cut_rectangle(b, a-b)  # Вызываем функцию для нового прямоугольника
    else:  # Иначе (сторона b больше стороны a), режем прямоугольник по стороне b
        side, count = cut_rectangle(a, b-a)  # Вызываем функцию для нового прямоугольника
    return side, count + 1  # Возвращаем длину ребра квадрата (side) и количество квадратов (count + 1)
a = 15
b = 18
side, count = cut_rectangle(a, b)
print(f"Длина ребра квадратов: {side}")
print(f"Количество квадратов: {count}")
