def cut_rectangle(a, b):
    while a == b:  # Если стороны уже равны, возвращаем длину ребра квадрата и количество квадратов (1)
        return a, 1
    if b < a:  # Если сторона a больше стороны b, режем прямоугольник по стороне a
        side, count = cut_rectangle(b, a-b)  # Вызываем функцию для нового прямоугольника
    else:  # Иначе (сторона b больше стороны a), режем прямоугольник по стороне b
        side, count = cut_rectangle(a, b-a)  # Вызываем функцию для нового прямоугольника
    return side, count + 1  # Возвращаем длину ребра квадрата (side) и количество квадратов (count + 1)
a = int(input("Введите длину прямоугольника: "))
b = int(input("Введите ширину прямоугольника: "))
side, count = cut_rectangle(a, b)
print(f"Длина ребра квадратов: {side}")
print(f"Количество квадратов: {count}")

'''Введите длину прямоугольника: 10
Введите ширину прямоугольника: 11
Длина ребра квадратов: 1
Количество квадратов: 11

Введите длину прямоугольника: 3
Введите ширину прямоугольника: 3
Длина ребра квадратов: 3
Количество квадратов: 1


